{
  "backend/main.mo": "Defines dish, nutrition, and health input types, stores recipes in a Map, and provides functions to add recipes and return filtered or customized recommendations based on allergies and favorite foods.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of major frontend files, describing their purpose and recent localization-related updates.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH theme variables for light and dark modes and applying global UI styling.",
  "frontend/index.html": "HTML entry point configuring metadata, icon, root element, and main script loader for the frontend app.",
  "frontend/src/App.tsx": "Main React app layout managing form state, results display, UI sections, and localized text through I18nProvider.",
  "frontend/src/components/DecorativeImage.tsx": "Image component that hides itself on load failure to prevent broken decorative assets.",
  "frontend/src/components/DishImage.tsx": "Displays dish images with error handling, fallback UI, and automatic error reset when the photo reference changes.",
  "frontend/src/components/HealthInputForm.tsx": "Form component for collecting age, weight, conditions, allergies, BP, and food preferences, then requesting recommendations. Handles validation, search-based condition entry, and mutation trigger.",
  "frontend/src/components/LanguageToggle.tsx": "Button that switches the app language between English and Spanish using the i18n context.",
  "frontend/src/components/ResultsView.tsx": "Displays health input summary and recommended dishes, including star meal detection and nutrition formatting. Provides a back button to edit inputs.",
  "frontend/src/components/SoundtrackControls.tsx": "Audio player UI with play/pause, volume, mute controls, and error handling, synced with soundtrack preference storage. Loads and manages looping background music.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useI18n.ts": "Convenience hook that returns the i18n context and throws if used outside the provider.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth provider and hook managing login, stored identities, status flags, and client configuration.",
  "frontend/src/hooks/useQueries.ts": "Defines mutation hook for fetching food recommendations from the backend actor using provided health parameters.",
  "frontend/src/hooks/useSoundtrackPreferences.ts": "Manages soundtrack preferences (enabled, volume, muted) with localStorage persistence and helper setters.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides language state, translation lookup, and persistence via localStorage for the app's i18n system.",
  "frontend/src/i18n/strings.ts": "Provides English and Spanish translation strings for all UI text, including form labels, results view, validation, and controls.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom OKLCH color variables for light and dark themes.",
  "frontend/src/lib/format.ts": "Exports a helper to safely convert bigint nutrition values to strings.",
  "frontend/src/lib/validation.ts": "Validates health form inputs with language-specific error messages for English and Spanish.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom theme variables, colors, animations, and plugins.",
  "project_state.json": "Stores project metadata, requirements, issues, and architectural notes for the app’s build state."
}