{
  "backend/main.mo": "Motoko canister defining Dish data, storing recipes in a map, adding recipes, and returning filtered food recommendations with allergy checks and a grey‑zone ingredients list.",
  "backend/migration.mo": "Migration module that initializes the recipe database with default dishes if empty and preserves existing data otherwise.",
  "feature_evidence.json": "Report listing feature evidence for allergies toggle and expanded health‑conditions picker, linking each to affected frontend files and requirements.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files covering components, hooks, styling, and utilities.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens for light and dark modes and global theming variables.",
  "frontend/index.html": "HTML entry point setting metadata, favicon, root mount point, and loading the main script.",
  "frontend/src/App.tsx": "Main React app managing form state, submitting for recommendations, and toggling between input and results views.",
  "frontend/src/components/DishImage.tsx": "Reusable image component loading static dish photos with error fallback UI.",
  "frontend/src/components/HealthInputForm.tsx": "Comprehensive health‑input form with searchable conditions list, allergy management including a no‑allergies toggle, validation, and backend query.",
  "frontend/src/components/ResultsView.tsx": "Renders the results page showing user health summary and recommended dishes with badges and images.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, including login, logout, and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query mutation for fetching food recommendations from the backend actor.",
  "frontend/src/index.css": "Sets global Tailwind layers and defines a health‑themed OKLCH color palette and base styles.",
  "frontend/src/lib/format.ts": "Converts bigint nutrition values into readable strings with fallback handling.",
  "frontend/src/lib/validation.ts": "Validates health input fields such as age, weight, and blood pressure with range checks.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, typography, animations, and plugins.",
  "project_state.json": "Stores project metadata, active features, issues, and architectural notes for build planning."
}