{
  "backend/main.mo": "Motoko canister storing recipes, adding new ones, and returning filtered recommendations based on allergies with basic helper functions.",
  "feature_evidence.json": "Feature evidence report listing required UI asset behavior, audio playback fixes, and related files/components.",
  "frontend-file-summaries.txt": "Plain-text map of frontend file paths to short functional summaries for build reference.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens and light/dark theme variables with global background and border styles.",
  "frontend/index.html": "HTML entry point loading the React app and favicon with meta description.",
  "frontend/src/App.tsx": "Main React app managing form state, results toggle, hero section with decorative images, and page layout including audio controls.",
  "frontend/src/components/DecorativeImage.tsx": "Image wrapper that hides itself on load error to avoid broken decorative assets.",
  "frontend/src/components/DishImage.tsx": "Dish image component resolving static asset paths with error fallback UI and reset on reference change.",
  "frontend/src/components/HealthInputForm.tsx": "Comprehensive health input form handling conditions, allergies, validation, and submit flow invoking recommendations.",
  "frontend/src/components/ResultsView.tsx": "Displays user health input summary and recommended dishes with badges, images, and navigation back to editing inputs.",
  "frontend/src/components/SoundtrackControls.tsx": "Provides audio playback, volume, and mute controls using saved soundtrack preferences with error handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements authentication context for Internet Identity, including login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines a mutation hook that calls the backend to fetch food recommendations based on health parameters.",
  "frontend/src/hooks/useSoundtrackPreferences.ts": "Manages persistent soundtrack settings such as enabled state, volume, and mute using localStorage.",
  "frontend/src/index.css": "Configures Tailwind and defines light/dark theme CSS variables for colors, radius, and UI styling.",
  "frontend/src/lib/format.ts": "Formats bigint nutrition values into readable strings with fallback handling.",
  "frontend/src/lib/validation.ts": "Validates user health form inputs including age, weight, blood pressure, and logical constraints.",
  "frontend/src/main.tsx": "Initializes the app root, wrapping it with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s state, including app goals, architectural notes, known issues, image requirements, and existing features for a health‑focused food‑recommendation app."
}