{
  "kind": "build_request",
  "title": "Update branding to “Barrera Healthy Eats”, add tiger decorations, and add optional soundtrack",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "Change the app/website name to “Barrera Healthy Eats” everywhere it is user-visible, including the HTML document title and the in-app header/footer branding text that currently displays “HealthyEats”.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Oh can you change the website name to Barrera Healthy Eats?"
        ]
      },
      "acceptanceCriteria": [
        "Browser tab title uses “Barrera Healthy Eats” (replacing the existing “HealthyEats - Personalized Food Recommendations” title).",
        "The in-app header brand name text shows “Barrera Healthy Eats”.",
        "The footer copyright line shows “Barrera Healthy Eats”.",
        "No remaining user-visible occurrences of “HealthyEats” are present in the app UI after the change (excluding code/internal identifiers if any)."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Add small tiger-themed decorative elements to the UI as subtle accents (e.g., small corner/edge decals in the header and/or hero section) using generated static image assets served from the frontend public assets path.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "And maybe add little tigers as decorations?"
        ]
      },
      "acceptanceCriteria": [
        "At least two tiger decorative images are rendered in the UI as non-intrusive decorations (they must not block or overlap key form controls or results content on common screen sizes).",
        "Tiger decorations load from frontend static assets (not from the backend).",
        "Decorations are purely ornamental and do not add new navigation or functional flows.",
        "Decorations look acceptable in both light and dark mode (no harsh contrast or illegible overlays)."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Add an optional soundtrack/background music feature that users can control (play/pause and volume or mute), with the soundtrack off by default and the user’s choice persisted locally so it stays consistent on refresh.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "And maybe if you can, add a soundtrack?"
        ]
      },
      "acceptanceCriteria": [
        "A visible music control UI exists (at minimum: play/pause and a mute toggle or volume slider).",
        "Soundtrack is OFF by default on first visit (no auto-play).",
        "If the user turns the soundtrack on/off (and adjusts mute/volume if provided), the preference persists across page reloads on the same device/browser.",
        "Audio file is served as a frontend static asset (not via the backend).",
        "Music controls do not interfere with form submission or results browsing (controls remain accessible and do not cover primary content)."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (shadcn UI sources are read-only).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Serve decorative images and soundtrack audio as static frontend assets; do not route them through the Motoko backend.",
    "Keep backend architecture as a single Motoko actor; no backend changes are required for these UI-only additions."
  ],
  "nonGoals": [
    "Fixing the existing dish photo rendering issue or backend recipe seeding issues (not requested in this change).",
    "Adding real-time or streaming features (e.g., WebSockets) for audio.",
    "Implementing third-party music integrations (e.g., Spotify/Apple Music).",
    "Adding authentication changes or user accounts beyond existing Internet Identity support."
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Create small tiger decal illustrations in a cohesive style (tiger-decal-left.dim_256x256.png)",
      "Create small tiger decal illustrations in a cohesive style (tiger-decal-right.dim_256x256.png)",
      "Create a small tiger icon that can be used as a subtle accent (tiger-icon.dim_128x128.png)"
    ]
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}