{
  "kind": "build_request",
  "title": "Add Spanish language toggle button and translate UI strings",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-30",
      "text": "Add a language toggle control to the app UI with a button labeled exactly “Cambiar A Español” that switches the app’s UI language from English to Spanish when activated.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Can you add a button that says “Cambiar A Español” and it translates the text to Spanish?"
        ]
      },
      "acceptanceCriteria": [
        "A button with the exact visible label “Cambiar A Español” is present on the app UI when the current language is English.",
        "Clicking the button switches the UI language to Spanish without requiring a refresh.",
        "The toggle is available on both the initial (form) screen and the results screen (so users can switch languages in either view)."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Implement a simple in-app localization mechanism (no external translation services) and translate all user-facing UI strings currently hard-coded in the frontend into Spanish, including (at minimum) strings in `frontend/src/App.tsx`, `frontend/src/components/HealthInputForm.tsx`, `frontend/src/components/ResultsView.tsx`, and `frontend/src/components/SoundtrackControls.tsx`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "it translates the text to Spanish"
        ]
      },
      "acceptanceCriteria": [
        "When Spanish is selected, the visible UI labels, headings, helper text, and button text in the above components are shown in Spanish (excluding user-entered data).",
        "When English is selected, the UI shows the original English text.",
        "The following must be translated (non-exhaustive examples to validate coverage): header tagline (“Personalized nutrition guidance”), hero heading/paragraph, form section titles/descriptions (e.g., “Your Health Information”), field labels (e.g., “Age (years)”, “Weight (kg)”, “Blood Pressure (mmHg)”), button labels (e.g., “Search Foods”, “Edit Inputs”), empty-state message (“No recommendations found…”), and soundtrack control aria-labels and popover text (e.g., “Volume”, “Muted”)."
      ]
    },
    {
      "id": "REQ-32",
      "text": "Define the language-toggle behavior for returning to English: when the current language is Spanish, provide a visible control that switches the UI back to English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ]
      },
      "acceptanceCriteria": [
        "When Spanish is selected, there is a visible control to switch back to English.",
        "Switching back restores English UI strings immediately without a refresh.",
        "The “Cambiar A Español” label is only used for the English->Spanish control (it does not appear while Spanish is active)."
      ]
    },
    {
      "id": "REQ-33",
      "text": "Persist the user’s language selection in local storage so the chosen language remains consistent after a page refresh.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ]
      },
      "acceptanceCriteria": [
        "If a user switches to Spanish and refreshes the page, the app loads in Spanish.",
        "If a user switches back to English and refreshes the page, the app loads in English.",
        "If local storage is unavailable or errors occur, the app safely defaults to English without crashing."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Do not attempt to automatically translate backend-provided recipe content (e.g., dish names, ingredient lists, instructions, and health explanations) unless explicit Spanish equivalents are available in the data; the language toggle should primarily affect the frontend UI chrome and static strings.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ]
      },
      "acceptanceCriteria": [
        "Toggling language does not break rendering of recommendation data returned from the backend.",
        "Dish content remains readable and unchanged if no Spanish version exists (no placeholder or partial machine-translation behavior is introduced)."
      ]
    }
  ],
  "constraints": [
    "Frontend files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and `frontend/src/components/ui` must not be edited.",
    "Do not add external translation/LLM services or third-party i18n platforms; implement translations locally in the frontend codebase."
  ],
  "nonGoals": [
    "Adding Spanish translations to the Motoko backend recipe database or returning bilingual recommendation payloads.",
    "Implementing auto-detection of browser language beyond the persisted user preference (default can remain English).",
    "Translating user-entered values (e.g., typed health conditions, allergies, favorite food)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}