{
  "kind": "build_request",
  "title": "Fix empty recommendations, add “No allergies”, and expand selectable health conditions",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Ensure the backend returns non-empty food recommendations by seeding the in-canister recipe database with a built-in set of real dishes available immediately after deployment (no manual addRecipe calls required).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "It shows no food"
        ]
      },
      "acceptanceCriteria": [
        "Calling getFoodRecommendations with valid inputs and an empty allergies list returns between 1 and 5 Dish items (unless the dataset truly contains fewer than 1 dish, which must not happen after seeding).",
        "Seeded dishes include the full Dish fields already used by the frontend: name, photoReference (can be empty to trigger fallback), healthExplanation, ingredients, instructions, nutritionSummary (calories, sodium, protein, carbohydrates, fats).",
        "The seeded dataset is large enough to avoid frequent empty results for typical inputs (target at least ~30 dishes, within code-size limits)."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Add a user-facing “No allergies” option in the Allergies section that lets users explicitly indicate they have no allergies, clears any selected/typed allergies, and sends an empty allergies list to the backend recommendation query.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "can you add an option of no allergies?"
        ]
      },
      "acceptanceCriteria": [
        "The Allergies UI includes a clearly labeled option: \"No allergies\".",
        "When \"No allergies\" is selected, any existing allergy tags are cleared and allergen quick-add buttons are unselected.",
        "Submitting the form with \"No allergies\" selected results in the request sending allergies: [] (an empty array).",
        "If the user adds any allergy after selecting \"No allergies\", the UI automatically unselects \"No allergies\" (so the state is never contradictory)."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Expand the Health Conditions input to support selecting from a broad, built-in list of common health conditions (while still allowing custom conditions to be added), so users do not need to type most conditions manually.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Also add like all the Health conditions you can"
        ]
      },
      "acceptanceCriteria": [
        "The Health Conditions UI includes a selectable list of many common conditions (significantly more than the current helper text), presented in a way that is usable on mobile (e.g., searchable list and/or quick-add chips/buttons).",
        "Users can still add a custom condition not present in the list.",
        "Selected health conditions are shown as removable tags (as they are today).",
        "Selected conditions are submitted to the backend in the existing healthConditions array field."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Make allergy filtering in getFoodRecommendations robust to common user input variations by applying case-insensitive matching between user allergies and dish ingredients, and ensure that an empty allergies list disables allergen filtering.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "It shows no food, and can you add an option of no allergies?"
        ]
      },
      "acceptanceCriteria": [
        "If allergies is an empty array, getFoodRecommendations does not filter out dishes based on ingredients.",
        "Allergy filtering compares normalized values (at minimum: case-insensitive) so that inputs like \"eggs\" correctly match ingredients like \"Eggs\".",
        "With a seeded dataset, providing a common allergy (e.g., \"eggs\") reduces results by filtering dishes containing that allergen, rather than returning an empty list due to casing mismatches."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not edit frontend files in immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Use English for any user-facing text.",
    "Do not serve images from the backend; dish photos must continue to be frontend static assets and gracefully fall back when missing."
  ],
  "nonGoals": [
    "Do not add third-party authentication beyond Internet Identity.",
    "Do not add external databases or non-Internet-Computer backend services.",
    "Do not claim medical accuracy; the app remains general wellness guidance (not medical advice)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}