{
  "kind": "build_request",
  "title": "Add Favorite Food input and show a Star Meal result based on the user’s favorite food",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-26",
      "text": "Add a new optional \"Favorite food\" text input to the health input form so a user can enter their favorite food before pressing the existing primary button labeled exactly “Search Foods”.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Where you put your favorite food, and when you put the same button of the search for meal, at the end it shows Star Meal and it shows your favorite food..."
        ]
      },
      "acceptanceCriteria": [
        "The health input form includes a clearly labeled optional text input: \"Favorite food\".",
        "The existing primary submit button text remains exactly “Search Foods”.",
        "Typing a favorite food updates the form state and is included in the submission payload when the user presses “Search Foods”.",
        "If the favorite food input is left empty, the app behaves as it did previously (no errors; recommendations still load)."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Extend the frontend form data model and recommendation request to include an optional `favoriteFood` string, and update the backend canister method signature used by the frontend to accept this new parameter when fetching recommendations.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "...it shows Star Meal and it shows your favorite food..."
        ]
      },
      "acceptanceCriteria": [
        "Frontend form data type includes `favoriteFood: string` (empty string allowed).",
        "The React Query mutation that calls the backend passes `favoriteFood` to the backend recommendation method.",
        "Backend `getFoodRecommendations` accepts the favorite food parameter (as Text) in addition to the existing parameters.",
        "The generated/consumed frontend backend bindings (the type definitions used by `useQueries.ts`) are updated so TypeScript compiles without `any` casts or signature mismatches."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Implement backend recommendation behavior so that when a user provides a non-empty favorite food, the returned recommendations include a dedicated “Star Meal” entry based on that favorite food, including a health explanation, ingredient list, cooking instructions, and nutrition summary.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "...at the end it shows Star Meal and it shows your favorite food with ingredients that can make you health better and same food!"
        ]
      },
      "acceptanceCriteria": [
        "If `favoriteFood` is non-empty (after trimming), `getFoodRecommendations` returns a Dish representing the user’s favorite food as a “Star Meal”.",
        "The Star Meal Dish includes non-empty values for `name`, `healthExplanation`, `ingredients`, `instructions`, and `nutritionSummary`.",
        "The Star Meal Dish respects allergy constraints: it must not include any ingredient that matches (case-insensitive) any user-provided allergy; if necessary, the ingredient list uses safe substitutions or omits conflicting ingredients.",
        "If `favoriteFood` is empty, the backend does not add a Star Meal entry and returns recommendations as before."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Update the results UI to visibly highlight the “Star Meal” in the recommendations results (and show the user’s favorite food name), while keeping all user-facing text in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "...it shows Star Meal and it shows your favorite food..."
        ]
      },
      "acceptanceCriteria": [
        "When a Star Meal dish is present in results, the UI displays a prominent label/badge reading “Star Meal” on that dish card.",
        "The Star Meal card clearly shows the favorite food name as the dish title (or as part of the title).",
        "All Star Meal-related user-facing labels are in English.",
        "If no Star Meal is present, the results UI renders as it did previously."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services).",
    "Do not edit any frontend files under `frontend/src/components/ui` or any paths listed in `frontend.immutablePaths` in SYSTEM_CONTEXT.",
    "Do not change the primary submit button label; it must remain exactly “Search Foods”.",
    "Do not serve images from the backend; continue using frontend static assets only."
  ],
  "nonGoals": [
    "Implementing third-party nutrition/recipe APIs or any external database to look up real recipes for arbitrary favorite foods.",
    "Adding new authentication providers beyond Internet Identity.",
    "Adding real-time updates (WebSockets) or push notifications."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}