{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore tiger hero decals and fix soundtrack playback reliability",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Make hero tiger decals render reliably on the initial screen and hide broken images on load failure.",
      "acceptanceCriteria": [
        "On a fresh load (before results are shown), the hero section displays two subtle tiger decal images (one top-left, one bottom-right).",
        "The decals load from the exact public paths `/assets/generated/tiger-decal-left.dim_256x256.png` and `/assets/generated/tiger-decal-right.dim_256x256.png` without showing broken-image UI.",
        "If an asset is missing or fails to load, the UI hides the broken image element (no broken-image icon/box is shown)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DecorativeImage.tsx",
          "operation": "create",
          "description": "Create a small, reusable decorative <img> wrapper that hides itself when the underlying asset fails to load (onError), preventing broken-image UI while keeping layout stable."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Replace the two hero-section raw <img> tiger decals with the new DecorativeImage wrapper so they reliably render on the initial (non-results) screen and automatically hide on load error; keep sources exactly `/assets/generated/tiger-decal-left.dim_256x256.png` and `/assets/generated/tiger-decal-right.dim_256x256.png`. Also wire in the required generated icon asset by rendering `frontend/public/assets/generated/tiger-icon.dim_128x128.png` as a subtle inline hero decoration (non-results screen) using the same broken-image hiding behavior."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Ensure the required tiger decal static assets exist under the public generated assets directory using exact filenames.",
      "acceptanceCriteria": [
        "`frontend/public/assets/generated/tiger-decal-left.dim_256x256.png` exists and is served by the frontend.",
        "`frontend/public/assets/generated/tiger-decal-right.dim_256x256.png` exists and is served by the frontend."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/tiger-decal-left.dim_256x256.png",
          "operation": "create",
          "description": "Add the generated left tiger decal image asset at the exact path `frontend/public/assets/generated/tiger-decal-left.dim_256x256.png` so it is served at runtime."
        },
        {
          "path": "frontend/public/assets/generated/tiger-decal-right.dim_256x256.png",
          "operation": "create",
          "description": "Add the generated right tiger decal image asset at the exact path `frontend/public/assets/generated/tiger-decal-right.dim_256x256.png` so it is served at runtime."
        },
        {
          "path": "frontend/public/assets/generated/tiger-icon.dim_128x128.png",
          "operation": "create",
          "description": "Add the required generated tiger icon asset at the exact path `frontend/public/assets/generated/tiger-icon.dim_128x128.png` so it can be referenced from the UI."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Fix soundtrack playback so Play produces audible audio, state reflects playback, and failures show a user-facing message.",
      "acceptanceCriteria": [
        "When the user clicks the Play button in the header, background music becomes audible within 1 second (assuming the browser/audio is allowed and volume is not muted).",
        "The Play/Pause icon correctly reflects playback state (Play when stopped, Pause when playing).",
        "If playback fails (e.g., browser blocks it or the file is missing), the app shows a clear English, user-facing message indicating audio could not be played (and does not only log to the console).",
        "The audio file is served from `/assets/audio/barrera-healthy-eats-theme.mp3` (frontend static asset), and the Play button uses that file."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SoundtrackControls.tsx",
          "operation": "modify",
          "description": "Refactor playback flow to attempt `audio.play()` directly from the user click handler (to satisfy browser autoplay policies) while still loading from `/assets/audio/barrera-healthy-eats-theme.mp3`, keep the Play/Pause icon in sync with actual playback (e.g., via audio events), and display a clear English, user-facing error message in the UI when playback fails or the file cannot be loaded. Use existing shadcn/ui components (Button, Popover, Slider) to present controls and any error messaging; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Ensure the soundtrack MP3 exists in frontend public assets and is served at the exact URL used by the app.",
      "acceptanceCriteria": [
        "`frontend/public/assets/audio/barrera-healthy-eats-theme.mp3` exists and is served by the frontend at runtime.",
        "Clicking Play does not produce a 404 for `/assets/audio/barrera-healthy-eats-theme.mp3` in the browser network panel."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/audio/barrera-healthy-eats-theme.mp3",
          "operation": "create",
          "description": "Add the soundtrack MP3 at the exact path `frontend/public/assets/audio/barrera-healthy-eats-theme.mp3` so it is served at runtime at `/assets/audio/barrera-healthy-eats-theme.mp3`."
        }
      ]
    }
  ]
}