{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Barrera Healthy Eats branding, tiger decals, and optional soundtrack",
  "requirements": [
    {
      "id": "REQ-19",
      "summary": "Update all user-visible branding text and document title to “Barrera Healthy Eats”.",
      "acceptanceCriteria": [
        "Browser tab title uses “Barrera Healthy Eats” (replacing the existing “HealthyEats - Personalized Food Recommendations” title).",
        "The in-app header brand name text shows “Barrera Healthy Eats”.",
        "The footer copyright line shows “Barrera Healthy Eats”.",
        "No remaining user-visible occurrences of “HealthyEats” are present in the app UI after the change (excluding code/internal identifiers if any)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Replace the HTML document <title> with “Barrera Healthy Eats” so the browser tab title matches the new branding."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update header and footer user-visible brand text from “HealthyEats” to “Barrera Healthy Eats”, and scan this file for any other user-visible occurrences to update."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Add subtle tiger decorative decals (static assets) to the header and/or hero without affecting usability in light/dark mode.",
      "acceptanceCriteria": [
        "At least two tiger decorative images are rendered in the UI as non-intrusive decorations (they must not block or overlap key form controls or results content on common screen sizes).",
        "Tiger decorations load from frontend static assets (not from the backend).",
        "Decorations are purely ornamental and do not add new navigation or functional flows.",
        "Decorations look acceptable in both light and dark mode (no harsh contrast or illegible overlays)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/tiger-decal-left.dim_256x256.png",
          "operation": "create",
          "description": "Add the generated static tiger decal asset at the required path so it can be served directly by the frontend."
        },
        {
          "path": "frontend/public/assets/generated/tiger-decal-right.dim_256x256.png",
          "operation": "create",
          "description": "Add the generated static tiger decal asset at the required path so it can be served directly by the frontend."
        },
        {
          "path": "frontend/public/assets/generated/tiger-icon.dim_128x128.png",
          "operation": "create",
          "description": "Add the generated static tiger icon asset at the required path so it can be served directly by the frontend."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Render at least two purely decorative tiger images (using frontend/public/assets/generated/tiger-decal-left.dim_256x256.png and frontend/public/assets/generated/tiger-decal-right.dim_256x256.png, optionally frontend/public/assets/generated/tiger-icon.dim_128x128.png) as subtle accents in the header and/or hero section with positioning/z-index/pointer-event settings that avoid covering primary content and remain visually acceptable in both light and dark mode."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Add optional background music with play/pause and mute/volume controls, default off, persisting preferences locally.",
      "acceptanceCriteria": [
        "A visible music control UI exists (at minimum: play/pause and a mute toggle or volume slider).",
        "Soundtrack is OFF by default on first visit (no auto-play).",
        "If the user turns the soundtrack on/off (and adjusts mute/volume if provided), the preference persists across page reloads on the same device/browser.",
        "Audio file is served as a frontend static asset (not via the backend).",
        "Music controls do not interfere with form submission or results browsing (controls remain accessible and do not cover primary content)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/audio/barrera-healthy-eats-theme.mp3",
          "operation": "create",
          "description": "Add a soundtrack audio file as a static frontend asset to be loaded directly by the browser (not via the backend)."
        },
        {
          "path": "frontend/src/hooks/useSoundtrackPreferences.ts",
          "operation": "create",
          "description": "Create a small hook to manage soundtrack state (enabled/playing, mute/volume) with localStorage persistence and safe defaults (off by default)."
        },
        {
          "path": "frontend/src/components/SoundtrackControls.tsx",
          "operation": "create",
          "description": "Create a reusable UI component that displays music controls (at minimum play/pause and mute toggle or volume control) and connects to the preferences hook without triggering auto-play."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire SoundtrackControls into the app layout (e.g., header area or a non-overlapping fixed corner) and ensure the audio element loads frontend/public/assets/audio/barrera-healthy-eats-theme.mp3, remains off by default, and the controls stay accessible without covering form/results content."
        }
      ]
    }
  ]
}