{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Allergies “No allergies” option and expanded selectable health conditions",
  "requirements": [
    {
      "id": "REQ-14",
      "summary": "Add a user-facing “No allergies” option that clears selected allergies and submits an empty allergies array, while preventing contradictory allergy state.",
      "acceptanceCriteria": [
        "The Allergies UI includes a clearly labeled option: \"No allergies\".",
        "When \"No allergies\" is selected, any existing allergy tags are cleared and allergen quick-add buttons are unselected.",
        "Submitting the form with \"No allergies\" selected results in the request sending allergies: [] (an empty array).",
        "If the user adds any allergy after selecting \"No allergies\", the UI automatically unselects \"No allergies\" (so the state is never contradictory)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HealthInputForm.tsx",
          "operation": "modify",
          "description": "Implement a dedicated \"No allergies\" control and state (e.g., boolean flag) in the Allergies section. Use existing shadcn-ui components already used in the file (Button/Badge/Input/Label) to render a clear toggle for \"No allergies\"; when enabled, clear allergyInput and allergies, and ensure common-allergy quick-add buttons reflect the cleared state. Update allergy add/remove handlers so adding any allergy automatically disables \"No allergies\". Ensure form submission continues to pass allergies as an empty array when \"No allergies\" is selected. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Expand Health Conditions to include a broad built-in selectable list (mobile-usable) while keeping support for custom conditions and removable tags.",
      "acceptanceCriteria": [
        "The Health Conditions UI includes a selectable list of many common conditions (significantly more than the current helper text), presented in a way that is usable on mobile (e.g., searchable list and/or quick-add chips/buttons).",
        "Users can still add a custom condition not present in the list.",
        "Selected health conditions are shown as removable tags (as they are today).",
        "Selected conditions are submitted to the backend in the existing healthConditions array field."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HealthInputForm.tsx",
          "operation": "modify",
          "description": "Add a built-in, broad COMMON_HEALTH_CONDITIONS list (many items) and a simple mobile-friendly selection UI (e.g., searchable/filterable list with quick-add buttons/chips) using existing shadcn-ui components (Input/Button/Badge/Label/Card) already present in the project. Keep the existing custom condition input flow, but enhance handleAddCondition to support adding from the built-in list and from free text (normalizing and preventing duplicates). Maintain removable tags display for selected conditions and ensure submit continues sending the existing healthConditions array unchanged in shape. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}