{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Favorite Food input + Star Meal highlight in results",
  "requirements": [
    {
      "id": "REQ-26",
      "summary": "Add an optional “Favorite food” text input to the health input form without changing the primary button label.",
      "acceptanceCriteria": [
        "The health input form includes a clearly labeled optional text input: \"Favorite food\".",
        "The existing primary submit button text remains exactly “Search Foods”.",
        "Typing a favorite food updates the form state and is included in the submission payload when the user presses “Search Foods”.",
        "If the favorite food input is left empty, the app behaves as it did previously (no errors; recommendations still load)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HealthInputForm.tsx",
          "operation": "modify",
          "description": "Add local form state for an optional favorite food value, render a clearly labeled \"Favorite food\" text field using shadcn-ui Input/Label, and include the value in the formData submitted on \"Search Foods\" while keeping the button label exactly “Search Foods”. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Extend the frontend form data model and recommendation request to carry optional favoriteFood and pass it through the React Query mutation to backend bindings.",
      "acceptanceCriteria": [
        "Frontend form data type includes `favoriteFood: string` (empty string allowed).",
        "The React Query mutation that calls the backend passes `favoriteFood` to the backend recommendation method.",
        "Backend `getFoodRecommendations` accepts the favorite food parameter (as Text) in addition to the existing parameters.",
        "The generated/consumed frontend backend bindings (the type definitions used by `useQueries.ts`) are updated so TypeScript compiles without `any` casts or signature mismatches."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Extend the HealthFormData type to include `favoriteFood: string` (empty string allowed) and initialize it in the default form state so it persists between form and results views."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Extend the GetFoodRecommendationsParams type to include `favoriteFood: string`, and update the mutation to pass favoriteFood to the backend actor getFoodRecommendations call in a type-safe way (e.g., convert empty string to null if required by current frontend bindings)."
        },
        {
          "path": "frontend/src/components/HealthInputForm.tsx",
          "operation": "modify",
          "description": "Update HealthInputForm submission payload to include `favoriteFood` (as a string, empty allowed) and pass it into the useFoodRecommendations mutation variables so it reaches the backend call; keep existing validation behavior unchanged for empty favorite food. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "If needed after backend signature changes, update the frontend type definitions for `backendInterface.getFoodRecommendations` so TypeScript matches the actor method signature (including the favoriteFood parameter) without `any` casts or mismatches."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Highlight a “Star Meal” dish in results and display the user’s favorite food name when present, with all labels in English.",
      "acceptanceCriteria": [
        "When a Star Meal dish is present in results, the UI displays a prominent label/badge reading “Star Meal” on that dish card.",
        "The Star Meal card clearly shows the favorite food name as the dish title (or as part of the title).",
        "All Star Meal-related user-facing labels are in English.",
        "If no Star Meal is present, the results UI renders as it did previously."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ResultsView.tsx",
          "operation": "modify",
          "description": "Detect when a Star Meal is present (e.g., by matching dish.name to the non-empty formData.favoriteFood in a case-insensitive/trimmed comparison), and render a prominent English “Star Meal” badge/label and visual emphasis (e.g., special border/background) on that card while leaving non-star dishes unchanged. Use existing shadcn-ui Badge/Card styling patterns and verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ResultsView.tsx",
          "operation": "modify",
          "description": "Optionally add the favorite food value to the results summary section (only when non-empty) to reinforce that the Star Meal corresponds to the user’s favorite food, ensuring all user-facing text remains in English and existing rendering remains unchanged when favoriteFood is empty."
        }
      ]
    }
  ]
}